<a href="https://colab.research.google.com/github/you0229/kaggle_titanic/blob/master/main.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
# google drive mount
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
# library
import pandas as pd 
import numpy as np
from sklearn.ensemble import RandomForestClassifier

In [32]:
# path
train_path = '/content/drive/My Drive/MachineLeaning/kaggle_titanic/train.csv'
test_path = '/content/drive/My Drive/MachineLeaning/kaggle_titanic/test.csv'

# data load
train= pd.read_csv(train_path)
test= pd.read_csv(test_path)

del train_path
del test_path

train.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

In [36]:
combine1 = [train]

# Ticket 前処理
for train in combine1: 
        display(train['Ticket'].head(5))

        # train['Ticket_Lett'] = train['Ticket'].apply(lambda x: str(x))

        # display(train['Ticket_Lett'].head(5))

        train['Ticket_Lett'] = train['Ticket'].apply(lambda x: str(x)[0])

        display(train['Ticket_Lett'].head(5))

        train['Ticket_Lett'] = train['Ticket_Lett'].apply(lambda x: str(x)) 
        
        display(train['Ticket_Lett'].head(5))
        
        # train['Ticket_Lett'] = np.where((train['Ticket_Lett']).isin(['1', '2', '3', 'S', 'P', 'C', 'A']), train['Ticket_Lett'], np.where((train['Ticket_Lett']).isin(['W', '4', '7', '6', 'L', '5', '8']), '0','0')) 
        # train['Ticket_Len'] = train['Ticket'].apply(lambda x: len(x)) 
        # del train['Ticket'] 
# train['Ticket_Lett']=train['Ticket_Lett'].replace("1",1).replace("2",2).replace("3",3).replace("0",0).replace("S",3).replace("P",0).replace("C",3).replace("A",3)

0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
Name: Ticket, dtype: object

0    A
1    P
2    S
3    1
4    3
Name: Ticket_Lett, dtype: object

0    A
1    P
2    S
3    1
4    3
Name: Ticket_Lett, dtype: object

In [5]:
# info
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
# 性別を0 or 1に変更
# Embarked(搭乗位置)を0 or 1 or 2 に変更
train= train.replace("male",0).replace("female",1).replace("S",0).replace("C",1).replace("Q",2)
test= test.replace("male",0).replace("female",1).replace("S",0).replace("C",1).replace("Q",2)

display('train', train.head(3))
display('test', test.head(3))

'train'

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN       0.0
1            2         1       1  ...  71.2833    C85       1.0
2            3         1       3  ...   7.9250    NaN       0.0

[3 rows x 12 columns]

'test'

   PassengerId  Pclass  ... Cabin  Embarked
0          892       3  ...   NaN         2
1          893       3  ...   NaN         0
2          894       2  ...   NaN         2

[3 rows x 11 columns]

In [7]:
# 欠損値処理
train["Age"].fillna(train.Age.mean(), inplace=True) 
train["Embarked"].fillna(train.Embarked.mean(), inplace=True)

display('train', train.info())
display('test', test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null int64
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       891 non-null float64
dtypes: float64(3), int64(6), object(3)
memory usage: 83.7+ KB

'train'

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null int64
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null int64
dtypes: float64(2), int64(6), object(3)
memory usage: 36.0+ KB

'test'

None

In [8]:
# ???
combine1 = [train]

# 正規表現で分割
for train in combine1: 
        display(train.head(5))
        train['Salutation'] = train.Name.str.extract(' ([A-Za-z]+).', expand=False) 
        display(train.head(5))

#  正規化
for train in combine1: 
        train['Salutation'] = train['Salutation'].replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')
        train['Salutation'] = train['Salutation'].replace('Mlle', 'Miss')
        train['Salutation'] = train['Salutation'].replace('Ms', 'Miss')
        train['Salutation'] = train['Salutation'].replace('Mme', 'Mrs')
        del train['Name']
        display(train.head(5))

#  数値に変換
Salutation_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5} 
for train in combine1: 
        train['Salutation'] = train['Salutation'].map(Salutation_mapping) 
        train['Salutation'] = train['Salutation'].fillna(0)
        display(train.head(5))

train.head(3)

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN       0.0
1            2         1       1  ...  71.2833    C85       1.0
2            3         1       3  ...   7.9250    NaN       0.0
3            4         1       1  ...  53.1000   C123       0.0
4            5         0       3  ...   8.0500    NaN       0.0

[5 rows x 12 columns]

   PassengerId  Survived  Pclass  ... Cabin  Embarked  Salutation
0            1         0       3  ...   NaN       0.0          Mr
1            2         1       1  ...   C85       1.0         Mrs
2            3         1       3  ...   NaN       0.0        Miss
3            4         1       1  ...  C123       0.0         Mrs
4            5         0       3  ...   NaN       0.0          Mr

[5 rows x 13 columns]

   PassengerId  Survived  Pclass  Sex  ...     Fare  Cabin  Embarked Salutation
0            1         0       3    0  ...   7.2500    NaN       0.0         Mr
1            2         1       1    1  ...  71.2833    C85       1.0        Mrs
2            3         1       3    1  ...   7.9250    NaN       0.0       Miss
3            4         1       1    1  ...  53.1000   C123       0.0        Mrs
4            5         0       3    0  ...   8.0500    NaN       0.0         Mr

[5 rows x 12 columns]

   PassengerId  Survived  Pclass  Sex  ...     Fare  Cabin  Embarked Salutation
0            1         0       3    0  ...   7.2500    NaN       0.0        1.0
1            2         1       1    1  ...  71.2833    C85       1.0        3.0
2            3         1       3    1  ...   7.9250    NaN       0.0        2.0
3            4         1       1    1  ...  53.1000   C123       0.0        3.0
4            5         0       3    0  ...   8.0500    NaN       0.0        1.0

[5 rows x 12 columns]

   PassengerId  Survived  Pclass  Sex  ...     Fare  Cabin  Embarked Salutation
0            1         0       3    0  ...   7.2500    NaN       0.0        1.0
1            2         1       1    1  ...  71.2833    C85       1.0        3.0
2            3         1       3    1  ...   7.9250    NaN       0.0        2.0

[3 rows x 12 columns]

In [0]:
# Ticket 前処理
for train in combine1: 
        train['Ticket_Lett'] = train['Ticket'].apply(lambda x: str(x)[0])
        train['Ticket_Lett'] = train['Ticket_Lett'].apply(lambda x: str(x)) 
        train['Ticket_Lett'] = np.where((train['Ticket_Lett']).isin(['1', '2', '3', 'S', 'P', 'C', 'A']), train['Ticket_Lett'], np.where((train['Ticket_Lett']).isin(['W', '4', '7', '6', 'L', '5', '8']), '0','0')) 
        train['Ticket_Len'] = train['Ticket'].apply(lambda x: len(x)) 
        del train['Ticket'] 
train['Ticket_Lett']=train['Ticket_Lett'].replace("1",1).replace("2",2).replace("3",3).replace("0",0).replace("S",3).replace("P",0).replace("C",3).replace("A",3)

In [0]:
# Cabin 前処理
for train in combine1: 
    train['Cabin_Lett'] = train['Cabin'].apply(lambda x: str(x)[0]) 
    train['Cabin_Lett'] = train['Cabin_Lett'].apply(lambda x: str(x)) 
    train['Cabin_Lett'] = np.where((train['Cabin_Lett']).isin([ 'F', 'E', 'D', 'C', 'B', 'A']),train['Cabin_Lett'], np.where((train['Cabin_Lett']).isin(['W', '4', '7', '6', 'L', '5', '8']), '0','0'))
del train['Cabin'] 
train['Cabin_Lett']=train['Cabin_Lett'].replace("A",1).replace("B",2).replace("C",1).replace("0",0).replace("D",2).replace("E",2).replace("F",1)

In [11]:
train.head(10)

   PassengerId  Survived  Pclass  ...  Ticket_Lett  Ticket_Len  Cabin_Lett
0            1         0       3  ...            3           9           0
1            2         1       1  ...            0           8           1
2            3         1       3  ...            3          16           0
3            4         1       1  ...            1           6           1
4            5         0       3  ...            3           6           0
5            6         0       3  ...            3           6           0
6            7         0       1  ...            1           5           2
7            8         0       3  ...            3           6           0
8            9         1       3  ...            3           6           0
9           10         1       2  ...            2           6           0

[10 rows x 13 columns]

In [0]:
#  FamilySizeとIsAlone を追加
train["FamilySize"] = train["SibSp"] + train["Parch"] + 1
for train in combine1:
    train['IsAlone'] = 0
    train.loc[train['FamilySize'] == 1, 'IsAlone'] = 1

In [0]:
#  説明変数と目的変数に分ける
train_data = train.values
xs = train_data[:, 2:] # Pclass以降の変数
y  = train_data[:, 1]  # 正解データ

In [14]:
# テストデータ
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null int64
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null int64
dtypes: float64(2), int64(6), object(3)
memory usage: 36.0+ KB

In [0]:
#  テストデータの前処理
 test["Age"].fillna(train.Age.mean(), inplace=True)
test["Fare"].fillna(train.Fare.mean(), inplace=True)

combine = [test]
for test in combine:
    test['Salutation'] = test.Name.str.extract(' ([A-Za-z]+)\.', expand=False)
for test in combine:
    test['Salutation'] = test['Salutation'].replace(['Lady', 'Countess','Capt', 'Col',\
         'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')

    test['Salutation'] = test['Salutation'].replace('Mlle', 'Miss')
    test['Salutation'] = test['Salutation'].replace('Ms', 'Miss')
    test['Salutation'] = test['Salutation'].replace('Mme', 'Mrs')
    del test['Name']
Salutation_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5}

for test in combine:
    test['Salutation'] = test['Salutation'].map(Salutation_mapping)
    test['Salutation'] = test['Salutation'].fillna(0)

for test in combine:
        test['Ticket_Lett'] = test['Ticket'].apply(lambda x: str(x)[0])
        test['Ticket_Lett'] = test['Ticket_Lett'].apply(lambda x: str(x))
        test['Ticket_Lett'] = np.where((test['Ticket_Lett']).isin(['1', '2', '3', 'S', 'P', 'C', 'A']), test['Ticket_Lett'],
                                   np.where((test['Ticket_Lett']).isin(['W', '4', '7', '6', 'L', '5', '8']),
                                            '0', '0'))
        test['Ticket_Len'] = test['Ticket'].apply(lambda x: len(x))
        del test['Ticket']
test['Ticket_Lett']=test['Ticket_Lett'].replace("1",1).replace("2",2).replace("3",3).replace("0",0).replace("S",3).replace("P",0).replace("C",3).replace("A",3) 

for test in combine:
        test['Cabin_Lett'] = test['Cabin'].apply(lambda x: str(x)[0])
        test['Cabin_Lett'] = test['Cabin_Lett'].apply(lambda x: str(x))
        test['Cabin_Lett'] = np.where((test['Cabin_Lett']).isin(['T', 'H', 'G', 'F', 'E', 'D', 'C', 'B', 'A']),test['Cabin_Lett'],
                                   np.where((test['Cabin_Lett']).isin(['W', '4', '7', '6', 'L', '5', '8']),
                                            '0','0'))        
        del test['Cabin']
test['Cabin_Lett']=test['Cabin_Lett'].replace("A",1).replace("B",2).replace("C",1).replace("0",0).replace("D",2).replace("E",2).replace("F",1).replace("G",1) 

test["FamilySize"] = train["SibSp"] + train["Parch"] + 1

for test in combine:
    test['IsAlone'] = 0
    test.loc[test['FamilySize'] == 1, 'IsAlone'] = 1
    
test_data = test.values
xs_test = test_data[:, 1:]

In [0]:
from sklearn.ensemble import RandomForestClassifier

random_forest=RandomForestClassifier()
random_forest.fit(xs, y)
Y_pred = random_forest.predict(xs_test)

import csv
with open("predict_result_data.csv", "w") as f:
    writer = csv.writer(f, lineterminator='\n')
    writer.writerow(["PassengerId", "Survived"])
    for pid, survived in zip(test_data[:,0].astype(int), Y_pred.astype(int)):
        writer.writerow([pid, survived])